## Requirements
# [Homebrew](https://github.com/Homebrew/brew) - dependencies
# [Cask](https://github.com/Homebrew/homebrew-cask) - mac applications
# [mas-cli](brew install mas) - Mac App Store applications
# [Visual Studio Code](https://code.visualstudio.com/) - VS Code extensions

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "shopify/shopify"
brew "pycparser"
brew "cffi"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "chroma"
brew "docker", link: false
brew "icu4c"
brew "ffmpeg"
brew "git"
brew "git-flow-avh"
brew "git-lfs"
brew "jq"
brew "node@18", link: true
brew "postgresql@12", restart_service: true
brew "postgresql@15", restart_service: true, link: true
brew "virtualenv"
brew "virtualenvwrapper"
brew "zsh"
brew "shopify/shopify/theme-check"
cask "1password"
cask "arc"
cask "docker"
cask "font-jetbrains-mono"
cask "linear-linear"
cask "notion"
cask "pgadmin4"
cask "popsql"
cask "readdle-spark"
cask "slack"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "linear.linear-connect"
vscode "linear.linear-open-issue"
vscode "marp-team.marp-vscode"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "Prisma.prisma"
vscode "Shopify.theme-check-vscode"
vscode "thebearingedge.vscode-sql-lit"
vscode "WallabyJs.quokka-vscode"
vscode "ziyasal.vscode-open-in-github"
